Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_i2c.c
/**
  ******************************************************************************
  * @file    bl602_i2c.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl602_i2c.h"
#include "bl602_glb.h"

/** @addtogroup  BL602_Peripheral_Driver
 *  @{
 */

/** @addtogroup  I2C
 *  @{
 */

/** @defgroup  I2C_Private_Macros
 *  @{
 */
#define I2C_FIFO_STATUS_TIMEOUT (160 * 1000 * 2)
#define PUT_UINT32_LE(n, b, i)               \
    {                                        \
        (b)[(i)] = (uint8_t)((n));           \
        (b)[(i) + 1] = (uint8_t)((n) >> 8);  \
        (b)[(i) + 2] = (uint8_t)((n) >> 16); \
        (b)[(i) + 3] = (uint8_t)((n) >> 24); \
    }

/*@} end of group I2C_Private_Macros */

/** @defgroup  I2C_Private_Types
 *  @{
 */

/*@} end of group I2C_Private_Types */

/** @defgroup  I2C_Private_Variables
 *  @{
 */
intCallback_Type *i2cIntCbfArra[I2C_ID_MAX][I2C_INT_ALL] = { { NULL } };

/*@} end of group I2C_Private_Variables */

/** @defgroup  I2C_Global_Variables
 *  @{
 */

/*@} end of group I2C_Global_Variables */

/** @defgroup  I2C_Private_Fun_Declaration
 *  @{
 */

/*@} end of group I2C_Private_Fun_Declaration */

/** @defgroup  I2C_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  I2C interrupt handler
 *
 * @param  i2cNo: I2C ID type
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void I2C_IntHandler(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_INT_STS);

    if (BL_IS_REG_BIT_SET(tmpVal, I2C_END_INT)) {
        if (i2cIntCbfArra[i2cNo][I2C_TRANS_END_INT] != NULL) {
            /* Call the callback function */
            i2cIntCbfArra[i2cNo][I2C_TRANS_END_INT]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, I2C_TXF_INT)) {
        if (i2cIntCbfArra[i2cNo][I2C_TX_FIFO_READY_INT] != NULL) {
            /* Call the callback function */
            i2cIntCbfArra[i2cNo][I2C_TX_FIFO_READY_INT]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, I2C_RXF_INT)) {
        if (i2cIntCbfArra[i2cNo][I2C_RX_FIFO_READY_INT] != NULL) {
            /* Call the callback function */
            i2cIntCbfArra[i2cNo][I2C_RX_FIFO_READY_INT]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, I2C_NAK_INT)) {
        if (i2cIntCbfArra[i2cNo][I2C_NACK_RECV_INT] != NULL) {
            /* Call the callback function */
            i2cIntCbfArra[i2cNo][I2C_NACK_RECV_INT]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, I2C_ARB_INT)) {
        if (i2cIntCbfArra[i2cNo][I2C_ARB_LOST_INT] != NULL) {
            /* Call the callback function */
            i2cIntCbfArra[i2cNo][I2C_ARB_LOST_INT]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, I2C_FER_INT)) {
        if (i2cIntCbfArra[i2cNo][I2C_FIFO_ERR_INT] != NULL) {
            /* Call the callback function */
            i2cIntCbfArra[i2cNo][I2C_FIFO_ERR_INT]();
        }
    }
}
#endif

/*@} end of group I2C_Private_Functions */

/** @defgroup  I2C_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  I2C write word data
 *
 * @param  i2cNo: I2C ID type
 * @param  data: Data word
 *
 * @return None
 *
*******************************************************************************/
void I2C_SendWord(I2C_ID_Type i2cNo, uint32_t data)
{
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));
    BL_WR_REG(I2Cx, I2C_FIFO_WDATA, data);
}

/****************************************************************************/ /**
 * @brief  I2C read word data
 *
 * @param  i2cNo: I2C ID type
 *
 * @return word data
 *
*******************************************************************************/
uint32_t I2C_RecieveWord(I2C_ID_Type i2cNo)
{
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));
    return BL_RD_REG(I2Cx, I2C_FIFO_RDATA);
}

/****************************************************************************/ /**
 * @brief  I2C enable
 *
 * @param  i2cNo: I2C ID type
 *
 * @return None
 *
*******************************************************************************/
void I2C_Enable(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_M_EN);

    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  I2C disable
 *
 * @param  i2cNo: I2C ID type
 *
 * @return None
 *
*******************************************************************************/
void I2C_Disable(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_M_EN);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    /* Clear I2C fifo */
    tmpVal = BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, I2C_TX_FIFO_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, I2C_RX_FIFO_CLR);
    BL_WR_REG(I2Cx, I2C_FIFO_CONFIG_0, tmpVal);

    /* Clear I2C interrupt status */
    tmpVal = BL_RD_REG(I2Cx, I2C_INT_STS);
    tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_END_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_NAK_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_ARB_CLR);
    BL_WR_REG(I2Cx, I2C_INT_STS, tmpVal);
}

/****************************************************************************/ /**
 * @brief  I2C set global reset function
 *
 * @param  i2cNo: I2C ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type I2C_Reset(I2C_ID_Type i2cNo)
{
    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_I2C);
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  I2C init function
 *
 * @param  i2cNo: I2C ID type
 * @param  direct: I2C read or write direct
 * @param  cfg: I2C transfer config struct
 *
 * @return None
 *
*******************************************************************************/
void I2C_Init(I2C_ID_Type i2cNo, I2C_Direction_Type direct, I2C_Transfer_Cfg *cfg)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    /* I2C write config */
    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (direct == I2C_WRITE) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_PKT_DIR);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_PKT_DIR);
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SLV_ADDR, cfg->slaveAddr);

    if (cfg->subAddrSize > 0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_SUB_ADDR_EN);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SUB_ADDR_BC, cfg->subAddrSize - 1);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_SUB_ADDR_EN);
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PKT_LEN, cfg->dataSize - 1);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    /* Set sub address */
    BL_WR_REG(I2Cx, I2C_SUB_ADDR, cfg->subAddr);

