Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_i2c.c
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(I2C_IRQn, I2C_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  Set de-glitch function cycle count value
 *
 * @param  i2cNo: I2C ID type
 * @param  cnt: De-glitch function cycle count
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type I2C_SetDeglitchCount(I2C_ID_Type i2cNo, uint8_t cnt)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (cnt > 0) {
        /* enable de-glitch function */
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_DEG_EN);
    } else if (cnt == 0) {
        /* disable de-glitch function */
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_DEG_EN);
    } else {
        return ERROR;
    }

    /* Set count value */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_DEG_CNT, cnt);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set i2c prd
 *
 * @param  i2cNo: I2C ID type
 * @param  phase: I2C phase value
 *
 * @return None
 *
*******************************************************************************/
void I2C_SetPrd(I2C_ID_Type i2cNo, uint8_t phase)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    //phase_cycles = (32000000 / phase / 4) - 1;
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_START);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_START, tmpVal);
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_STOP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_STOP, tmpVal);
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_DATA);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_DATA, tmpVal);
}

/****************************************************************************/ /**
 * @brief  I2C set scl output clock
 *
 * @param  i2cNo: I2C ID type
 * @param  clk: Clock set
 *
 * @return None
 *
*******************************************************************************/
void I2C_ClockSet(I2C_ID_Type i2cNo, uint32_t clk)
{
    uint8_t bclkDiv = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    bclkDiv = GLB_Get_BCLK_Div();

    if (clk >= 100000) {
        GLB_Set_I2C_CLK(1, 0);
        I2C_SetPrd(i2cNo, (SystemCoreClockGet() / (bclkDiv + 1)) / (clk * 4) - 1);
    } else if (clk >= 8000) {
        GLB_Set_I2C_CLK(1, 9);
        I2C_SetPrd(i2cNo, ((SystemCoreClockGet() / (bclkDiv + 1)) / 10) / (clk * 4) - 1);
    } else if (clk >= 800) {
        GLB_Set_I2C_CLK(1, 99);
        I2C_SetPrd(i2cNo, ((SystemCoreClockGet() / (bclkDiv + 1)) / 100) / (clk * 4) - 1);
    } else {
        GLB_Set_I2C_CLK(1, 255);
        I2C_SetPrd(i2cNo, ((SystemCoreClockGet() / (bclkDiv + 1)) / 256) / (clk * 4) - 1);
    }

    /* Disable i2c scl sync to get current i2c clock */
    I2C_SetSclSync(i2cNo, 0);
}

/****************************************************************************/ /**
 * @brief  I2C set scl sync
 *
 * @param  i2cNo: I2C ID type
 * @param  enable: Enable or disable I2C scl sync
 *
 * @return None
 *
*******************************************************************************/
void I2C_SetSclSync(I2C_ID_Type i2cNo, uint8_t enable)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_SCL_SYNC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_SCL_SYNC_EN);
    }

    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get i2c busy state
 *
 * @param  i2cNo: I2C ID type
 *
 * @return RESET or SET
 *
*******************************************************************************/
BL_Sts_Type I2C_IsBusy(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_INT_STS);
    return ((BL_IS_REG_BIT_SET(tmpVal, I2C_END_INT)) ? RESET : SET);
}

/****************************************************************************/ /**
 * @brief  I2C master write block data
 *
 * @param  i2cNo: I2C ID type
 * @param  cfg: I2C transfer config struct
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type I2C_MasterSendBlocking(I2C_ID_Type i2cNo, I2C_Transfer_Cfg *cfg)
{
    uint8_t i;
    uint32_t timeOut = 0;
    uint32_t temp = 0;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    I2C_Disable(i2cNo);
    I2C_Init(i2cNo, I2C_WRITE, cfg);
    I2C_Enable(i2cNo);

    /* Set I2C write data */
    for (i = 0; i < cfg->dataSize; i++) {
        temp += (cfg->data[i] << ((i % 4) * 8));

        if ((i + 1) % 4 == 0) {
            timeOut = I2C_FIFO_STATUS_TIMEOUT;

            while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_TX_FIFO_CNT) == 0) {
                timeOut--;

                if (timeOut == 0) {
                    I2C_Disable(i2cNo);
                    return TIMEOUT;
                }
            }

            BL_WR_REG(I2Cx, I2C_FIFO_WDATA, temp);
            temp = 0;
        }
    }

    if ((cfg->dataSize % 4) != 0) {
        timeOut = I2C_FIFO_STATUS_TIMEOUT;

        while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_TX_FIFO_CNT) == 0) {
            timeOut--;

            if (timeOut == 0) {
                I2C_Disable(i2cNo);
                return TIMEOUT;
            }
        }

        BL_WR_REG(I2Cx, I2C_FIFO_WDATA, temp);
    }

    timeOut = I2C_FIFO_STATUS_TIMEOUT;

